; domain
(define (domain trucker)
   (:predicates (location ?l)
		(package ?p)
		(truck ?t)
		(at-loc ?l)
		(at ?p ?l)
		(free ?t)
		(carry ?p ?t))

   (:action move
       :parameters (?from ?to)
       :precondition (and (location ?from) (location ?to) (at-loc ?from))
       :effect (and (at-loc ?to)
		     (not (at-loc ?from))))

   (:action pick
       :parameters (?pckg ?loc ?t)
       :precondition  (and (package ?pckg) (location ?loc) (truck ?t)
			    (at ?pckg ?loc) (at-loc ?loc) (free ?t))
       :effect (and (carry ?pckg ?t)
		    (not (at ?pckg ?loc))
		    (not (free ?t))))

   (:action drop
       :parameters (?pckg ?loc ?t)
       :precondition (and (package ?pckg) (location ?loc) (truck ?t)
			    (carry ?pckg ?t) (at-loc ?loc))
       :effect (and (at ?pckg ?loc)
		    (free ?t)
		    (not (carry ?pckg ?t)))))

; problem
(define (problem trucker-2-package)
   (:domain trucker)
   (:objects tampines changi bedok package1 package2 truck1)
   (:init (location tampines)
          (location changi)
          (location bedok)
          (package package1)
          (package package2)
          (truck truck1)
          (at-loc tampines)
          (free truck1)
          (at package1 bedok)
          (at package2 changi))
   (:goal (and (at package1 changi) (at package2 bedok))))

; plan
1. (move tampines changi)
   deleted: (at-loc tampines)
   added: (at-loc changi)
   goals met: 0 of 2
2. (pick package2 changi truck1)
   deleted: (at package2 changi) (free truck1)
   added: (carry package2 truck1)
   goals met: 0 of 2
3. (move changi bedok)
   deleted: (at-loc changi)
   added: (at-loc bedok)
   goals met: 0 of 2
4. (drop package2 bedok truck1)
   deleted: (carry package2 truck1)
   added: (at package2 bedok) (free truck1)
   goals met: 1 of 2
5. (pick package1 bedok truck1)
   deleted: (at package1 bedok) (free truck1)
   added: (carry package1 truck1)
   goals met: 1 of 2
6. (move bedok changi)
   deleted: (at-loc bedok)
   added: (at-loc changi)
   goals met: 1 of 2
7. (drop package1 changi truck1)
   deleted: (carry package1 truck1)
   added: (at package1 changi) (free truck1)
   goals met: 2 of 2
